app/controllers/api/spots_controller.rb

SELECT "spots".* FROM "spots"
---
    def index
        @spots = Spot.all