app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "first_name", "last_name", "birthday", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @user = User.new(
                username: params[:user][:username],
                password: params[:user][:password],
                first_name: params[:user][:first_name],
                last_name: params[:user][:last_name],
                birthday: params[:user][:birthday], # 1990-08-22 / yr-mth-day
                email: params[:user][:email]
                )

        if @user.save