app/models/user.rb

    def reset_session_token!
        # debugger
        self.session_token = SecureRandom::urlsafe_base64
        self.save
---
INSERT INTO "users" ("username", "email", "first_name", "last_name", "birthday", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0_WeGBA1_vbSJWRS8f1GEg"], ["updated_at", "2020-08-02 21:09:57.636599"], ["id", 30]]