app/models/user.rb

    def reset_session_token!
        # debugger
        self.session_token = SecureRandom::urlsafe_base64
        self.save
---
INSERT INTO "users" ("username", "email", "first_name", "last_name", "birthday", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "4_dqJoN_Tth-ykjVMVSwgw"], ["updated_at", "2020-07-28 22:11:34.611622"], ["id", 18]]